In [23]:
import pandas as pd

In [24]:
scientists = pd.read_csv('./data/scientists.csv')
ages = scientists['Age']
names = scientists['Name']
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

##### 바이너리 형태(pickle) 저장

In [25]:
scientists.to_pickle('./data/sceintists_df.pickle')
names.to_pickle('./data/scientists_names_series.pickle')

##### pickle 로드

In [26]:
pd.read_pickle('./data/scientists_df.pickle')
pd.read_pickle('./data/scientists_names_series.pickle')

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

##### csv 저장

In [27]:
scientists.to_csv('./data/scientist_df.csv')

In [28]:
df = pd.read_csv('./data/scientists_df.csv', index_col=0) # 0번째 열을 인덱스로 지정한다
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

##### 엑셀 열기

In [58]:
import pandas as pd

In [54]:
df1 = pd.read_excel("./data/scientists_names_serise_df.xls")
print(df1)

df2 = pd.read_excel("./data/scientists_names_serise_df.xlsx")
print(df2)

   Unnamed: 0                  Name
0           0     Rosaline Franklin
1           1        William Gosset
2           2  Florence Nightingale
3           3           Marie Curie
4           4         Rachel Carson
5           5             John Snow
6           6           Alan Turing
7           7          Johann Gauss
   Unnamed: 0                  Name
0           0     Rosaline Franklin
1           1        William Gosset
2           2  Florence Nightingale
3           3           Marie Curie
4           4         Rachel Carson
5           5             John Snow
6           6           Alan Turing
7           7          Johann Gauss

In [ ]:
# 강사님 오류
import xlwt
import openpyxl

names_df = scientists[['Name']]
names_df.to_excel('./data/scientists_names_serise_df.xls')
names_df.to_excel('./data/scientists_names_serise_df.xlsx')